#MySQL Tutorials <br>


1.   https://www.mysqltutorial.org/
2.   https://www.mysqltutorial.org/basic-mysql-tutorial.aspx

#Section 1 : Getting started with MySQL

##Install MySQL in local Colab VM

In [ ]:
# this will take some time and show an error. 
# dont worry, just carry on 
!apt install -y mysql-server > /dev/null
#!ls /etc/init.d
!/etc/init.d/mysql restart

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
No directory, logging in with HOME=/
   ...done.

## Download Sample Database - Classicmodels <br>
Create Tables <br>
https://www.mysqltutorial.org/mysql-sample-database.aspx

In [ ]:
#!gdown https://drive.google.com/uc?id=1Ik3QuYTd52M5qI9D4aOCfGcQ7v2AB9wx
#!wget https://sp.mysqltutorial.org/wp-content/uploads/2018/03/mysqlsampledatabase.zip
#!wget https://github.com/Praxis-QR/RDWH/raw/main/mysqlsampledatabase.zip

!wget -q https://github.com/Praxis-QR/RDWH/raw/main/data/mysqlsampledatabase.zip
!unzip mysqlsampledatabase.zip
#!cat /content/mysqlsampledatabase.sql
!head /content/mysqlsampledatabase.sql

Archive:  mysqlsampledatabase.zip
  inflating: mysqlsampledatabase.sql
/*
*********************************************************************
http://www.mysqltutorial.org
*********************************************************************
Name: MySQL Sample Database classicmodels
Link: http://www.mysqltutorial.org/mysql-sample-database.aspx
Version 3.1
+ changed data type from DOUBLE to DECIMAL for amount columns
Version 3.0
+ changed DATETIME to DATE for some colunmns

## Loading Sample Database into MySQL server

In [ ]:
#https://www.mysqltutorial.org/how-to-load-sample-database-into-mysql-database-server.aspx
!mysql --table < mysqlsampledatabase.sql
#New database classicmodels has been created
!mysql -e 'show databases'

+--------------------+
| Database           |
+--------------------+
| information_schema |
| classicmodels      |
| mysql              |
| performance_schema |
| sys                |
+--------------------+

##Check contents of sample database - Classicmodels

In [ ]:
!mysql classicmodels -e 'show tables'

+-------------------------+
| Tables_in_classicmodels |
+-------------------------+
| customers               |
| employees               |
| offices                 |
| orderdetails            |
| orders                  |
| payments                |
| productlines            |
| products                |
+-------------------------+


This is what the database looks like : <br><br>
![alt text](https://www.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png)<br>

In [ ]:
!mysql classicmodels -e 'select * from employees'

+----------------+-----------+-----------+-----------+---------------------------------+------------+-----------+----------------------+
| employeeNumber | lastName  | firstName | extension | email                           | officeCode | reportsTo | jobTitle             |
+----------------+-----------+-----------+-----------+---------------------------------+------------+-----------+----------------------+
|           1002 | Murphy    | Diane     | x5800     | dmurphy@classicmodelcars.com    | 1          |      NULL | President            |
|           1056 | Patterson | Mary      | x4611     | mpatterso@classicmodelcars.com  | 1          |      1002 | VP Sales             |
|           1076 | Firrelli  | Jeff      | x9273     | jfirrelli@classicmodelcars.com  | 1          |      1002 | VP Marketing         |
|           1088 | Patterson | William   | x4871     | wpatterson@classicmodelcars.com | 6          |      1056 | Sales Manager (APAC) |
|           1102 | Bondur    | Gerard    | x5408     | gbondur@classicmodelcars.com    | 4          |      1056 | Sale Manager (EMEA)  |
|           1143 | Bow       | Anthony   | x5428     | abow@classicmodelcars.com       | 1          |      1056 | Sales Manager (NA)   |
|           1165 | Jennings  | Leslie    | x3291     | ljennings@classicmodelcars.com  | 1          |      1143 | Sales Rep            |
|           1166 | Thompson  | Leslie    | x4065     | lthompson@classicmodelcars.com  | 1          |      1143 | Sales Rep            |
|           1188 | Firrelli  | Julie     | x2173     | jfirrelli@classicmodelcars.com  | 2          |      1143 | Sales Rep            |
|           1216 | Patterson | Steve     | x4334     | spatterson@classicmodelcars.com | 2          |      1143 | Sales Rep            |
|           1286 | Tseng     | Foon Yue  | x2248     | ftseng@classicmodelcars.com     | 3          |      1143 | Sales Rep            |
|           1323 | Vanauf    | George    | x4102     | gvanauf@classicmodelcars.com    | 3          |      1143 | Sales Rep            |
|           1337 | Bondur    | Loui      | x6493     | lbondur@classicmodelcars.com    | 4          |      1102 | Sales Rep            |
|           1370 | Hernandez | Gerard    | x2028     | ghernande@classicmodelcars.com  | 4          |      1102 | Sales Rep            |
|           1401 | Castillo  | Pamela    | x2759     | pcastillo@classicmodelcars.com  | 4          |      1102 | Sales Rep            |
|           1501 | Bott      | Larry     | x2311     | lbott@classicmodelcars.com      | 7          |      1102 | Sales Rep            |
|           1504 | Jones     | Barry     | x102      | bjones@classicmodelcars.com     | 7          |      1102 | Sales Rep            |
|           1611 | Fixter    | Andy      | x101      | afixter@classicmodelcars.com    | 6          |      1088 | Sales Rep            |
|           1612 | Marsh     | Peter     | x102      | pmarsh@classicmodelcars.com     | 6          |      1088 | Sales Rep            |
|           1619 | King      | Tom       | x103      | tking@classicmodelcars.com      | 6          |      1088 | Sales Rep            |
|           1621 | Nishi     | Mami      | x101      | mnishi@classicmodelcars.com     | 5          |      1056 | Sales Rep            |
|           1625 | Kato      | Yoshimi   | x102      | ykato@classicmodelcars.com      | 5          |      1621 | Sales Rep            |
|           1702 | Gerard    | Martin    | x2312     | mgerard@classicmodelcars.com    | 4          |      1102 | Sales Rep            |
+----------------+-----------+-----------+-----------+---------------------------------+------------+-----------+----------------------+

##Install Python Client <br>

In [ ]:
!apt install libmysqlclient-dev > /dev/null
!pip -q install mysqlclient 
import pandas as pd
import MySQLdb

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

     |████████████████████████████████| 87 kB 3.3 MB/s
  Building wheel for mysqlclient (setup.py) ... done

In [ ]:
#To run any non-SELECT SQL command
def runCMD (DDL):
    #DBConn= MySQLdb.connect(hostName,userName,passWord,dbName)
    DBConn= MySQLdb.connect(db='classicmodels')  # since local MySQL server, userid, password not needed
    myCursor = DBConn.cursor()
    retcode = myCursor.execute(DDL) 
    print (retcode)
    DBConn.commit()
    DBConn.close()

#To run any SELECT SQL command
def runSELECT (CMD):
    #DBConn= MySQLdb.connect(hostName,userName,passWord,dbName)
    DBConn= MySQLdb.connect(db='classicmodels') # since local MySQL server, userid, password not needed
    df_mysql = pd.read_sql(CMD, con=DBConn)    
    DBConn.close()
    return df_mysql

##Check out all tables

In [ ]:
!mysql classicmodels -e 'show tables'

+-------------------------+
| Tables_in_classicmodels |
+-------------------------+
| customers               |
| employees               |
| offices                 |
| orderdetails            |
| orders                  |
| payments                |
| productlines            |
| products                |
+-------------------------+

In [ ]:
#runSELECT('select * from customers limit 5')
#runSELECT('select * from employees limit 5')
#runSELECT('select * from offices limit 5')
#runSELECT('select * from orderdetails limit 5')
#runSELECT('select * from orders limit 5')
#runSELECT('select * from payments limit 5')
#runSELECT('select * from productlines limit 5')
runSELECT('select * from products limit 5')

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,Turnable front wheels; steering function; deta...,7305,98.58,214.30
2,S10_2016,1996 Moto Guzzi 1100i,Motorcycles,1:10,Highway 66 Mini Classics,"Official Moto Guzzi logos and insignias, saddl...",6625,68.99,118.94
3,S10_4698,2003 Harley-Davidson Eagle Drag Bike,Motorcycles,1:10,Red Start Diecast,"Model features, official Harley Davidson logos...",5582,91.02,193.66
4,S10_4757,1972 Alfa Romeo GTA,Classic Cars,1:10,Motor City Art Classics,Features include: Turnable front wheels; steer...,3252,85.68,136.00

#Section 1 : Querying Data

## SELECT FROM

In [ ]:
#1
# A) Using the MySQL SELECT statement to retrieve data from a single column

runSELECT('SELECT lastName FROM employees')

     lastName
0      Murphy
1   Patterson
2    Firrelli
3   Patterson
4      Bondur
5         Bow
6    Jennings
7    Thompson
8    Firrelli
9   Patterson
10      Tseng
11     Vanauf
12     Bondur
13  Hernandez
14   Castillo
15       Bott
16      Jones
17     Fixter
18      Marsh
19       King
20      Nishi
21       Kato
22     Gerard

In [ ]:
#2
# B) Using the MySQL SELECT statement to query data from multiple columns

runSELECT('SELECT lastName, firstName, jobTitle FROM employees')

     lastName firstName              jobTitle
0      Murphy     Diane             President
1   Patterson      Mary              VP Sales
2    Firrelli      Jeff          VP Marketing
3   Patterson   William  Sales Manager (APAC)
4      Bondur    Gerard   Sale Manager (EMEA)
5         Bow   Anthony    Sales Manager (NA)
6    Jennings    Leslie             Sales Rep
7    Thompson    Leslie             Sales Rep
8    Firrelli     Julie             Sales Rep
9   Patterson     Steve             Sales Rep
10      Tseng  Foon Yue             Sales Rep
11     Vanauf    George             Sales Rep
12     Bondur      Loui             Sales Rep
13  Hernandez    Gerard             Sales Rep
14   Castillo    Pamela             Sales Rep
15       Bott     Larry             Sales Rep
16      Jones     Barry             Sales Rep
17     Fixter      Andy             Sales Rep
18      Marsh     Peter             Sales Rep
19       King       Tom             Sales Rep
20      Nishi      Mami             Sales Rep
21       Kato   Yoshimi             Sales Rep
22     Gerard    Martin             Sales Rep

In [ ]:
#3
# C) Using the MySQL SELECT statement to retrieve data from all columns

runSELECT('SELECT employeeNumber,lastName, firstName, extension, email, officeCode, reportsTo, jobTitle FROM employees')

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
5,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
6,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep
7,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
10,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143.0,Sales Rep
11,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,3,1143.0,Sales Rep
12,1337,Bondur,Loui,x6493,lbondur@classicmodelcars.com,4,1102.0,Sales Rep
13,1370,Hernandez,Gerard,x2028,ghernande@classicmodelcars.com,4,1102.0,Sales Rep
14,1401,Castillo,Pamela,x2759,pcastillo@classicmodelcars.com,4,1102.0,Sales Rep
15,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102.0,Sales Rep
16,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep
17,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088.0,Sales Rep
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
19,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
20,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
21,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep

## SELECT

In [ ]:
#4
# ADD

runSELECT("SELECT 1 + 1")

   1 + 1
0      2

In [ ]:
#5
runSELECT("SELECT NOW()")

                NOW()
0 2022-04-11 17:08:42

In [ ]:
#6
runSELECT("SELECT CONCAT('John',' ','Doe')")

  CONCAT('John',' ','Doe')
0                 John Doe

In [ ]:
#7
runSELECT("SELECT CONCAT('John',' ','Doe') AS name")

       name
0  John Doe

In [ ]:
#8
# If the column alias contains spaces, you need to place it inside quotes like this:

runSELECT("SELECT CONCAT('Jane',' ','Doe') AS 'Full name'")

  Full name
0  Jane Doe

#Section 2 - Sorting Data

## ORDER BY

In [ ]:
#9
# A) Using MySQL ORDER BY clause to sort the result set by one column

runSELECT('SELECT contactLastname, contactFirstname FROM customers ORDER BY	contactLastname')

    contactLastname contactFirstname
0           Accorti           Paolo
1       Altagar,G M           Raanan
2          Andersen              Mel
3             Anton           Carmen
4          Ashworth           Rachel
..              ...              ...
117         Yoshido             Juri
118           Young             Jeff
119           Young            Julie
120           Young             Mary
121           Young          Dorothy

[122 rows x 2 columns]

In [ ]:
#10
runSELECT('SELECT	contactLastname, contactFirstname FROM customers ORDER BY	contactLastname DESC')

    contactLastname contactFirstname
0             Young             Jeff
1             Young            Julie
2             Young             Mary
3             Young          Dorothy
4           Yoshido             Juri
..              ...              ...
117        Ashworth           Rachel
118           Anton           Carmen
119        Andersen              Mel
120     Altagar,G M           Raanan
121         Accorti           Paolo

[122 rows x 2 columns]

In [ ]:
#11
# B) Using MySQL ORDER BY clause to sort the result set by multiple columns

runSELECT('SELECT contactLastname, contactFirstname FROM customers ORDER BY contactLastname DESC , contactFirstname ASC')

    contactLastname contactFirstname
0             Young          Dorothy
1             Young             Jeff
2             Young            Julie
3             Young             Mary
4           Yoshido             Juri
..              ...              ...
117        Ashworth           Rachel
118           Anton           Carmen
119        Andersen              Mel
120     Altagar,G M           Raanan
121         Accorti           Paolo

[122 rows x 2 columns]

In [ ]:
#12
# C) Using MySQL ORDER BY clause to sort a result set by an expression

runSELECT('SELECT orderNumber, orderlinenumber, quantityOrdered * priceEach FROM orderdetails ORDER BY quantityOrdered * priceEach DESC')

      orderNumber  orderlinenumber  quantityOrdered * priceEach
0           10403                9                     11503.14
1           10405                5                     11170.52
2           10407                2                     10723.60
3           10404                3                     10460.16
4           10312                3                     10286.40
...           ...              ...                          ...
2991        10425                6                       553.52
2992        10407                3                       546.66
2993        10322                3                       531.00
2994        10420                3                       529.35
2995        10419                7                       481.50

[2996 rows x 3 columns]

In [ ]:
#13
# To make the query more readable, you can assign the expression in the SELECT clause a column alias and use that column alias in the ORDER BY clause 

runSELECT('SELECT orderNumber, orderLineNumber, quantityOrdered * priceEach AS subtotal FROM orderdetails ORDER BY subtotal DESC')

      orderNumber  orderLineNumber  subtotal
0           10403                9  11503.14
1           10405                5  11170.52
2           10407                2  10723.60
3           10404                3  10460.16
4           10312                3  10286.40
...           ...              ...       ...
2991        10425                6    553.52
2992        10407                3    546.66
2993        10322                3    531.00
2994        10420                3    529.35
2995        10419                7    481.50

[2996 rows x 3 columns]

In [ ]:
#14
# FIELD() function to map each order status to a number and sort the result by the result of the FIELD() function:

runSELECT('SELECT orderNumber, status FROM orders ORDER BY FIELD(status, "In Process", "On Hold", "Cancelled", "Resolved", "Disputed", "Shipped")')

     orderNumber      status
0          10420  In Process
1          10421  In Process
2          10422  In Process
3          10423  In Process
4          10424  In Process
..           ...         ...
321        10412     Shipped
322        10413     Shipped
323        10416     Shipped
324        10418     Shipped
325        10419     Shipped

[326 rows x 2 columns]

In [ ]:
#15
# ORDER BY clause to sort employees by values in the reportsTo column:

runSELECT('SELECT firstName, lastName, reportsTo FROM employees ORDER BY reportsTo')

   firstName   lastName  reportsTo
0      Diane     Murphy        NaN
1       Mary  Patterson     1002.0
2       Jeff   Firrelli     1002.0
3    William  Patterson     1056.0
4     Gerard     Bondur     1056.0
5    Anthony        Bow     1056.0
6       Mami      Nishi     1056.0
7        Tom       King     1088.0
8      Peter      Marsh     1088.0
9       Andy     Fixter     1088.0
10    Martin     Gerard     1102.0
11     Barry      Jones     1102.0
12     Larry       Bott     1102.0
13    Pamela   Castillo     1102.0
14    Gerard  Hernandez     1102.0
15      Loui     Bondur     1102.0
16    George     Vanauf     1143.0
17  Foon Yue      Tseng     1143.0
18     Steve  Patterson     1143.0
19     Julie   Firrelli     1143.0
20    Leslie   Thompson     1143.0
21    Leslie   Jennings     1143.0
22   Yoshimi       Kato     1621.0

In [ ]:
#16
# ORDER BY with the DESC option, NULLs will appear last in the result set. For example:

runSELECT('SELECT firstName, lastName, reportsTo FROM employees ORDER BY reportsTo DESC')

   firstName   lastName  reportsTo
0    Yoshimi       Kato     1621.0
1     Leslie   Jennings     1143.0
2     Leslie   Thompson     1143.0
3      Julie   Firrelli     1143.0
4      Steve  Patterson     1143.0
5   Foon Yue      Tseng     1143.0
6     George     Vanauf     1143.0
7     Martin     Gerard     1102.0
8      Barry      Jones     1102.0
9      Larry       Bott     1102.0
10    Pamela   Castillo     1102.0
11    Gerard  Hernandez     1102.0
12      Loui     Bondur     1102.0
13      Andy     Fixter     1088.0
14     Peter      Marsh     1088.0
15       Tom       King     1088.0
16   Anthony        Bow     1056.0
17    Gerard     Bondur     1056.0
18   William  Patterson     1056.0
19      Mami      Nishi     1056.0
20      Jeff   Firrelli     1002.0
21      Mary  Patterson     1002.0
22     Diane     Murphy        NaN

#Section 3. Filtering data

## WHERE

In [ ]:
#17
# 1) Using MySQL WHERE clause with equality operator example

runSELECT('SELECT lastname, firstname, jobtitle FROM employees WHERE jobtitle = "Sales Rep"')

NameError: ignored

In [ ]:
# 2) Using MySQL WHERE clause with the AND operator

runSELECT('SELECT lastname, firstname, jobtitle, officeCode FROM employees WHERE jobtitle = "Sales Rep" AND officeCode = 1')

In [ ]:
#18
# 3) Using MySQL WHERE clause with OR operator

runSELECT('SELECT lastName, firstName, jobTitle, officeCode FROM employees WHERE jobtitle = "Sales Rep" OR officeCode = 1 ORDER BY officeCode , jobTitle')

In [ ]:
#19
# 4) Using MySQL WHERE clause with the BETWEEN operator example

runSELECT('SELECT firstName, lastName, officeCode FROM employees WHERE officeCode BETWEEN 1 AND 3 ORDER BY officeCode')

In [ ]:
#20
# 5) Using MySQL WHERE clause with the LIKE operator example

runSELECT('SELECT firstName, lastName FROM employees WHERE lastName LIKE "%son" ORDER BY firstName')

In [ ]:
#21
# 6) Using MySQL WHERE clause with the IN operator example

runSELECT('SELECT firstName, lastName, officeCode FROM employees WHERE officeCode IN (1 , 2, 3) ORDER BY officeCode')

In [ ]:
#22
# 7) Using MySQL WHERE clause with the IS NULL operator

runSELECT('SELECT lastName, firstName, reportsTo FROM employees WHERE reportsTo IS NULL')

In [ ]:
#23
# 8) Using MySQL WHERE clause with comparison operators

runSELECT('SELECT lastname, firstname, jobtitle FROM employees WHERE jobtitle <> "Sales Rep"')

## SELECT DISTINCT

In [ ]:
#24
# select the last names from the employees table using the following SELECT statement:

runSELECT('SELECT lastname FROM employees ORDER BY lastname')

In [ ]:
#25
# select unique last names by adding the DISTINCT clause like this:

runSELECT('SELECT DISTINCT lastname FROM employees ORDER BY lastname')

In [ ]:
#26
# use the DISTINCT clause to query the states, you will see distinct states and NULL as follows:

runSELECT('SELECT DISTINCT state FROM customers')

In [ ]:
#27
# To get a unique combination of city and state from the customers table

runSELECT('SELECT DISTINCT state, city FROM customers WHERE state IS NOT NULL ORDER BY state, city')

In [ ]:
#28
# Without the DISTINCT clause, you will get the duplicate combination of state and city

runSELECT('SELECT state, city FROM customers WHERE state IS NOT NULL ORDER BY state , city')

## AND

In [ ]:
#29
# The logical AND operator returns 1 if both A and B are non-zero and NOT NULL. 

runSELECT('SELECT 1 AND 1')

In [ ]:
#30
# The logical AND operator returns 0 if A or B is zero or both A and B are zero:

runSELECT('SELECT 1 AND 0, 0 AND 1, 0 AND 0, 0 AND NULL')

In [ ]:
#31
# The logical AND operator returns NULL if either operand is non-zero or both operands are NULL.

runSELECT('SELECT 1 AND NULL, NULL AND NULL')

In [ ]:
#32
# The following statement uses the AND operator to find customers who locate in California (CA), USA:

runSELECT("SELECT customername, country, state FROM customers WHERE country = 'USA' AND state = 'CA'")

In [ ]:
#33
# The following query returns the customers who locate in California, USA, and have a credit limit greater than 100K.

runSELECT("SELECT customername, country, state, creditlimit FROM customers WHERE country = 'USA' AND state = 'CA' AND creditlimit > 100000")

## OR

In [ ]:
#34
# If both A and B are zero (false), the OR operator returns zero

runSELECT('SELECT 0 OR 0')

In [ ]:
#35
# When A and / or B is NULL, the OR operator returns 1 (true) if either A or B is non-zero. Otherwise, it returns NULL. 

runSELECT('SELECT 1 OR NULL, 0 OR NULL, NULL or NULL')

In [ ]:
#36
# Like the AND operator, the OR operator is also short-circuited

runSELECT('SELECT 1 = 1 OR 1 / 0')

In [ ]:
#37
# MySQL evaluates the AND operator before the OR operator.

runSELECT('SELECT 1 OR 0 AND 0')

In [ ]:
#38
# To change the order of evaluation, you use the parentheses.

runSELECT('SELECT (1 OR 0) AND 0')

In [ ]:
#39
# The following query uses the OR operator in the WHERE clause to select all the customers located in the USA or France:

runSELECT("SELECT customername, country FROM customers WHERE country = 'USA' OR country = 'France'")

In [ ]:
#40
# The following example uses the OR operator to select the customers who locate in the USA or France and have a credit limit greater than 100,000.

runSELECT("SELECT	customername,	country, creditLimit FROM customers WHERE(country = 'USA'	OR country = 'France') AND creditlimit > 100000")

In [ ]:
#41
# If you do not use the parentheses, the query will return the customers who locate in the USA or the customers located in France with a credit limit greater than 100,000.

runSELECT("SELECT customername, country, creditLimit FROM customers WHERE country = 'USA' OR country = 'France' AND creditlimit > 100000")

## IN

In [ ]:
#41
# The following example uses the IN operator to find the offices located in the USA and France:

runSELECT("SELECT officeCode, city, phone, country FROM offices WHERE country IN ('USA' , 'France')")

In [ ]:
#42
# You can also get the same result with the OR operator like this:

runSELECT("SELECT officeCode, city, phone FROM offices WHERE country = 'USA' OR country = 'France'")

## NOT IN

In [ ]:
#43
# The following example uses the NOT IN operator to check if the number 1 is NOT IN the list (1,2,3):

runSELECT('SELECT 1 NOT IN (1,2,3)')

In [ ]:
#44
# The following example uses the NOT IN operator to check if 0 is NOT IN the list (1,2,3):

runSELECT('SELECT 0 NOT IN (1,2,3)')

In [ ]:
#45
# The NOT IN operator returns NULL if the value on the left side of the IN operator is NULL.

runSELECT('SELECT NULL NOT IN (1,2,3)')

In [ ]:
#46
# The following example uses the NOT IN operator to find the offices that do not locate in France and the USA:

runSELECT("SELECT officeCode, city, phone FROM offices WHERE country NOT IN ('USA' , 'France') ORDER BY city")

## BETWEEN

In [ ]:
#47
# For example, the following statement returns 1 because 15 is between 10 and 20:

runSELECT('SELECT 15 BETWEEN 10 AND 20')

In [ ]:
#48
# The following example returns 0 because 15 is not between 20 and 30:

runSELECT('SELECT 15 BETWEEN 20 AND 30')

In [ ]:
#49
# The following statement returns 0 because 15 is not between 10 and 20 is not true:

runSELECT("SELECT 15 NOT BETWEEN 10 AND 20")

In [ ]:
#50
# The following example uses the BETWEEN operator to find products whose buy prices between 90 and 100:

runSELECT('SELECT productCode, productName, buyPrice FROM products WHERE buyPrice BETWEEN 90 AND 100')

In [ ]:
#51
# This query uses the greater than or equal (>=) and less than or equal ( <= ) operators instead of the BETWEEN operator to get the same result:

runSELECT('SELECT productCode, productName, buyPrice FROM products WHERE buyPrice >= 90 AND buyPrice <= 100')

In [ ]:
#52
# To find the products whose buy prices are not between $20 and $100, you use the NOT BETWEEN operator as follows:

runSELECT('SELECT productCode, productName, buyPrice FROM products WHERE buyPrice NOT BETWEEN 20 AND 100')

In [ ]:
#53
# You can rewrite the query above using the less than (<), greater than (>), and the logical operator (AND) like this:

runSELECT('SELECT productCode, productName, buyPrice FROM products WHERE buyPrice < 20 OR buyPrice > 100')

In [ ]:
#54
# 2) Using MySQL BETWEEN operator with dates example

runSELECT("SELECT orderNumber, requiredDate, status FROM orders WHERE requireddate BETWEEN CAST('2003-01-01' AS DATE) AND CAST('2003-01-31' AS DATE)")

## LIKE

In [ ]:
#55
# A) Using MySQL LIKE operator with the percentage (%) wildcard examples

runSELECT("SELECT employeeNumber, lastName, firstName FROM employees WHERE firstName LIKE 'a%'")

NameError: ignored

In [ ]:
#56
# This example uses the LIKE operator to find employees whose last names end with the literal string on e.g., Patterson, Thompson:

runSELECT("SELECT employeeNumber, lastName, firstName FROM employees WHERE lastName LIKE '%on'")

In [ ]:
#57
# The following query uses the LIKE operator to find all employees whose last names contain the substring on:

runSELECT("SELECT employeeNumber, lastName, firstName FROM employees WHERE lastname LIKE '%on%'")

In [ ]:
#58
# B) Using MySQL LIKE operator with underscore( _ ) wildcard examples

runSELECT("SELECT employeeNumber, lastName, firstName FROM employees WHERE firstname LIKE 'T_m'")

In [ ]:
#59
# C) Using MySQL NOT LIKE operator example

runSELECT("SELECT employeeNumber, lastName, firstName FROM employees WHERE lastName NOT LIKE 'B%'")

In [ ]:
#60
# If you want to find products whose product codes contain the string _20 , you can use the pattern %\_20% with the default escape character:

runSELECT("SELECT productCode, productName FROM products WHERE productCode LIKE '%\_20%'")

In [ ]:
#61
# Alternatively, you can specify a different escape character e.g., $ using the ESCAPE clause:

runSELECT("SELECT productCode, productName FROM products WHERE productCode LIKE '%$_20%' ESCAPE '$'")

## LIMIT

In [ ]:
#62
# 1) Using MySQL LIMIT to get the highest or lowest rows

runSELECT('SELECT customerNumber, customerName, creditLimit FROM customers ORDER BY creditLimit DESC LIMIT 5')

In [ ]:
#63
# Similarly, this example uses the LIMIT clause to find five customers who have the lowest credits:

runSELECT("SELECT customerNumber, customerName, creditLimit FROM customers ORDER BY creditLimit LIMIT 5")

In [ ]:
#64
# To fix this issue, you need to add more columns to the ORDER BY clause to constrain the row in unique order:

runSELECT("SELECT customerNumber, customerName, creditLimit FROM customers ORDER BY creditLimit, customerNumber LIMIT 5")

In [ ]:
#65
# 2) Using MySQL LIMIT clause for pagination

runSELECT("SELECT COUNT(*) FROM customers")

In [ ]:
#66
# This query uses the LIMIT clause to get rows of page 1 which contains the first 10 customers sorted by the customer name:

runSELECT("SELECT customerNumber, customerName FROM customers ORDER BY customerName LIMIT 10")

In [ ]:
#67
# This query uses the LIMIT clause to get the rows of the second page that include rows 11 – 20:

runSELECT("SELECT customerNumber, customerName FROM customers ORDER BY customerName LIMIT 10, 10")

In [ ]:
#68
# 3) Using MySQL LIMIT to get the nth highest or lowest value

runSELECT("SELECT customerName, creditLimit FROM customers ORDER BY creditLimit DESC LIMIT 1,1")

In [ ]:
#69
# Let’s double-check the result. This query returns all customers sorted by credits from high to low:

runSELECT("SELECT customerName, creditLimit FROM customers ORDER BY creditLimit DESC")

In [ ]:
#70
# MySQL LIMIT & DISTINCT clauses

runSELECT("SELECT DISTINCT state FROM customers WHERE state IS NOT NULL LIMIT 5")

## IS NULL

In [ ]:
#71
# The following query uses the IS NULL operator to find customers who do not have a sales representative:

runSELECT("SELECT customerName, country, salesrepemployeenumber FROM customers WHERE salesrepemployeenumber IS NULL ORDER BY customerName")

In [ ]:
#72
# This example uses the IS NOT NULL operator to get the customers who have a sales representative:

runSELECT("SELECT customerName, country, salesrepemployeenumber FROM customers WHERE salesrepemployeenumber IS NOT NULL ORDER BY customerName")

# Section 4. Joining tables

## Table & Column Aliases

In [ ]:
#73
runSELECT("SELECT CONCAT_WS(', ', lastName, firstname) FROM employees;")

   CONCAT_WS(', ', lastName, firstname)
0                         Murphy, Diane
1                       Patterson, Mary
2                        Firrelli, Jeff
3                    Patterson, William
4                        Bondur, Gerard
5                          Bow, Anthony
6                      Jennings, Leslie
7                      Thompson, Leslie
8                       Firrelli, Julie
9                      Patterson, Steve
10                      Tseng, Foon Yue
11                       Vanauf, George
12                         Bondur, Loui
13                    Hernandez, Gerard
14                     Castillo, Pamela
15                          Bott, Larry
16                         Jones, Barry
17                         Fixter, Andy
18                         Marsh, Peter
19                            King, Tom
20                          Nishi, Mami
21                        Kato, Yoshimi
22                       Gerard, Martin

In [ ]:
#74
runSELECT("SELECT CONCAT_WS(', ', lastName, firstname) As 'Full name' FROM employees;")

             Full name
0        Murphy, Diane
1      Patterson, Mary
2       Firrelli, Jeff
3   Patterson, William
4       Bondur, Gerard
5         Bow, Anthony
6     Jennings, Leslie
7     Thompson, Leslie
8      Firrelli, Julie
9     Patterson, Steve
10     Tseng, Foon Yue
11      Vanauf, George
12        Bondur, Loui
13   Hernandez, Gerard
14    Castillo, Pamela
15         Bott, Larry
16        Jones, Barry
17        Fixter, Andy
18        Marsh, Peter
19           King, Tom
20         Nishi, Mami
21       Kato, Yoshimi
22      Gerard, Martin

In [ ]:
#75
runSELECT("SELECT CONCAT_WS(', ', lastName, firstname) As `Full name` FROM employees ORDER BY `Full name`;")

             Full name
0       Bondur, Gerard
1         Bondur, Loui
2          Bott, Larry
3         Bow, Anthony
4     Castillo, Pamela
5       Firrelli, Jeff
6      Firrelli, Julie
7         Fixter, Andy
8       Gerard, Martin
9    Hernandez, Gerard
10    Jennings, Leslie
11        Jones, Barry
12       Kato, Yoshimi
13           King, Tom
14        Marsh, Peter
15       Murphy, Diane
16         Nishi, Mami
17     Patterson, Mary
18    Patterson, Steve
19  Patterson, William
20    Thompson, Leslie
21     Tseng, Foon Yue
22      Vanauf, George

In [ ]:
#76
runSELECT("SELECT orderNumber `Order no.`, SUM(priceEach * quantityOrdered) total FROM orderdetails GROUP BY `Order no.` HAVING total > 60000;")

   Order no.     total
0      10165  67392.85
1      10287  61402.00
2      10310  61234.67

In [ ]:
#77
runSELECT("SELECT * FROM employees e")

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
5,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
6,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep
7,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
10,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143.0,Sales Rep
11,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,3,1143.0,Sales Rep
12,1337,Bondur,Loui,x6493,lbondur@classicmodelcars.com,4,1102.0,Sales Rep
13,1370,Hernandez,Gerard,x2028,ghernande@classicmodelcars.com,4,1102.0,Sales Rep
14,1401,Castillo,Pamela,x2759,pcastillo@classicmodelcars.com,4,1102.0,Sales Rep
15,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102.0,Sales Rep
16,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep
17,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088.0,Sales Rep
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
19,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
20,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
21,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep

In [ ]:
#78
runSELECT("SELECT e.firstName, e.lastName FROM employees e ORDER BY e.firstName;")

   firstName   lastName
0       Andy     Fixter
1    Anthony        Bow
2      Barry      Jones
3      Diane     Murphy
4   Foon Yue      Tseng
5     George     Vanauf
6     Gerard     Bondur
7     Gerard  Hernandez
8       Jeff   Firrelli
9      Julie   Firrelli
10     Larry       Bott
11    Leslie   Jennings
12    Leslie   Thompson
13      Loui     Bondur
14      Mami      Nishi
15    Martin     Gerard
16      Mary  Patterson
17    Pamela   Castillo
18     Peter      Marsh
19     Steve  Patterson
20       Tom       King
21   William  Patterson
22   Yoshimi       Kato

In [ ]:
#79
runSELECT("SELECT customerName, COUNT(o.orderNumber) total FROM customers c INNER JOIN orders o ON c.customerNumber = o.customerNumber GROUP BY customerName ORDER BY total DESC;")

                          customerName  total
0               Euro+ Shopping Channel     26
1         Mini Gifts Distributors Ltd.     17
2              Dragon Souveniers, Ltd.      5
3           Australian Collectors, Co.      5
4           Down Under Souveniers, Inc      5
..                                 ...    ...
93           Norway Gifts By Mail, Co.      2
94                         CAF Imports      2
95          Iberia Gift Imports, Corp.      2
96                Diecast Collectables      2
97  Bavarian Collectables Imports, Co.      1

[98 rows x 2 columns]

In [ ]:
#80
runSELECT("SELECT customers.customerName,COUNT(orders.orderNumber) total FROM customers INNER JOIN orders ON customers.customerNumber = orders.customerNumber GROUP BY customerName ORDER BY total DESC")

                          customerName  total
0               Euro+ Shopping Channel     26
1         Mini Gifts Distributors Ltd.     17
2              Dragon Souveniers, Ltd.      5
3           Australian Collectors, Co.      5
4           Down Under Souveniers, Inc      5
..                                 ...    ...
93           Norway Gifts By Mail, Co.      2
94                         CAF Imports      2
95          Iberia Gift Imports, Corp.      2
96                Diecast Collectables      2
97  Bavarian Collectables Imports, Co.      1

[98 rows x 2 columns]

## JOINS

In [ ]:
#81
!mysql classicmodels -e "CREATE TABLE members ( member_id INT AUTO_INCREMENT,name VARCHAR(100),PRIMARY KEY (member_id));"

In [ ]:
#82
!mysql classicmodels -e 'CREATE TABLE committees (committee_id INT AUTO_INCREMENT, name VARCHAR(100), PRIMARY KEY (committee_id));'

In [ ]:
#83
!mysql classicmodels -e "DROP TABLE committees"

In [ ]:
#84
!mysql classicmodels -e "\
INSERT INTO members(name) VALUES \
('John'),('Jane'),('Mary'),('David'),('Amelia')"

In [ ]:
#85
!mysql classicmodels -e "\
INSERT INTO committees(name) VALUES \
('John'),('Mary'),('Amelia'),('Joe')"

ERROR 1146 (42S02) at line 1: Table 'classicmodels.committees' doesn't exist

In [ ]:
#86
runSELECT("SELECT * FROM members")

   member_id    name
0          1    John
1          2    Jane
2          3    Mary
3          4   David
4          5  Amelia

In [ ]:
#87
runSELECT("SELECT * FROM committees")

DatabaseError: ignored

In [ ]:
#88
runSELECT("SELECT m.member_id, m.name AS member, c.committee_id, c.name AS committee FROM members m INNER JOIN committees c ON c.name = m.name;")

DatabaseError: ignored

In [ ]:
#89
runSELECT("SELECT m.member_id, m.name AS member, c.committee_id, c.name AS committee FROM members m INNER JOIN committees c USING(name);")

In [ ]:
#90
runSELECT("SELECT m.member_id, m.name AS member, c.committee_id, c.name AS committee FROM members m LEFT JOIN committees c USING(name);")

In [ ]:
#91
runSELECT("SELECT m.member_id, m.name AS member, c.committee_id, c.name AS committee FROM members m LEFT JOIN committees c USING(name) WHERE c.committee_id IS NULL;")

In [ ]:
#92
runSELECT("SELECT m.member_id, m.name AS member, c.committee_id, c.name AS committee FROM members m RIGHT JOIN committees c on c.name = m.name;")

In [ ]:
#93
runSELECT("SELECT m.member_id, m.name AS member, c.committee_id, c.name AS committee FROM members m RIGHT JOIN committees c USING(name);")

In [ ]:
#94
runSELECT("SELECT m.member_id, m.name AS member, c.committee_id, c.name AS committee FROM members m RIGHT JOIN committees c USING(name) WHERE m.member_id IS NULL;")

In [ ]:
#95
runSELECT("SELECT m.member_id, m.name AS member, c.committee_id, c.name AS committee FROM members m CROSS JOIN committees c;")

## INNER JOIN

In [ ]:
#96
runSELECT("SELECT productCode, productName, textDescription FROM products t1 INNER JOIN productlines t2 ON t1.productline = t2.productline")

,productCode,productName,textDescription
0,S10_1949,1952 Alpine Renault 1300,Attention car enthusiasts: Make your wildest c...
1,S10_4757,1972 Alfa Romeo GTA,Attention car enthusiasts: Make your wildest c...
2,S10_4962,1962 LanciaA Delta 16V,Attention car enthusiasts: Make your wildest c...
3,S12_1099,1968 Ford Mustang,Attention car enthusiasts: Make your wildest c...
4,S12_1108,2001 Ferrari Enzo,Attention car enthusiasts: Make your wildest c...
...,...,...,...
105,S24_3816,1940 Ford Delivery Sedan,Our Vintage Car models realistically portray a...
106,S24_3969,1936 Mercedes Benz 500k Roadster,Our Vintage Car models realistically portray a...
107,S24_4258,1936 Chrysler Airflow,Our Vintage Car models realistically portray a...
108,S32_4289,1928 Ford Phaeton Deluxe,Our Vintage Car models realistically portray a...
109,S50_1341,1930 Buick Marquette Phaeton,Our Vintage Car models realistically portray a...

In [ ]:
#97
runSELECT("SELECT \
    productCode, \
    productName, \
    textDescription \
FROM \
    products \
INNER JOIN productlines USING (productline)")

,productCode,productName,textDescription
0,S10_1949,1952 Alpine Renault 1300,Attention car enthusiasts: Make your wildest c...
1,S10_4757,1972 Alfa Romeo GTA,Attention car enthusiasts: Make your wildest c...
2,S10_4962,1962 LanciaA Delta 16V,Attention car enthusiasts: Make your wildest c...
3,S12_1099,1968 Ford Mustang,Attention car enthusiasts: Make your wildest c...
4,S12_1108,2001 Ferrari Enzo,Attention car enthusiasts: Make your wildest c...
...,...,...,...
105,S24_3816,1940 Ford Delivery Sedan,Our Vintage Car models realistically portray a...
106,S24_3969,1936 Mercedes Benz 500k Roadster,Our Vintage Car models realistically portray a...
107,S24_4258,1936 Chrysler Airflow,Our Vintage Car models realistically portray a...
108,S32_4289,1928 Ford Phaeton Deluxe,Our Vintage Car models realistically portray a...
109,S50_1341,1930 Buick Marquette Phaeton,Our Vintage Car models realistically portray a...

In [ ]:
#98
runSELECT("SELECT t1.orderNumber, t1.status, SUM(quantityOrdered * priceEach) total FROM orders t1 INNER JOIN orderdetails t2 ON t1.orderNumber = t2.orderNumber GROUP BY orderNumber")

     orderNumber      status     total
0          10100     Shipped  10223.83
1          10101     Shipped  10549.01
2          10102     Shipped   5494.78
3          10103     Shipped  50218.95
4          10104     Shipped  40206.20
..           ...         ...       ...
321        10421  In Process   7639.10
322        10422  In Process   5849.44
323        10423  In Process   8597.73
324        10424  In Process  29310.30
325        10425  In Process  41623.44

[326 rows x 3 columns]

In [ ]:
#99
runSELECT("SELECT orderNumber, status, SUM(quantityOrdered * priceEach) total FROM orders INNER JOIN orderdetails USING (orderNumber) GROUP BY orderNumber")

     orderNumber      status     total
0          10100     Shipped  10223.83
1          10101     Shipped  10549.01
2          10102     Shipped   5494.78
3          10103     Shipped  50218.95
4          10104     Shipped  40206.20
..           ...         ...       ...
321        10421  In Process   7639.10
322        10422  In Process   5849.44
323        10423  In Process   8597.73
324        10424  In Process  29310.30
325        10425  In Process  41623.44

[326 rows x 3 columns]

In [ ]:
#100
runSELECT("SELECT orderNumber, orderDate, orderLineNumber, productName, quantityOrdered, priceEach FROM orders INNER JOIN orderdetails USING (orderNumber) INNER JOIN products USING (productCode) ORDER BY orderNumber, orderLineNumber")

,orderNumber,orderDate,orderLineNumber,productName,quantityOrdered,priceEach
0,10100,2003-01-06,1,1936 Mercedes Benz 500k Roadster,49,35.29
1,10100,2003-01-06,2,1911 Ford Town Car,50,55.09
2,10100,2003-01-06,3,1917 Grand Touring Sedan,30,136.00
3,10100,2003-01-06,4,1932 Alfa Romeo 8C2300 Spider Sport,22,75.46
4,10101,2003-01-09,1,1928 Mercedes-Benz SSK,26,167.06
...,...,...,...,...,...,...
2991,10425,2005-05-31,9,1962 Volkswagen Microbus,49,127.79
2992,10425,2005-05-31,10,1926 Ford Fire Engine,19,48.62
2993,10425,2005-05-31,11,1980’s GM Manhattan Express,41,83.79
2994,10425,2005-05-31,12,1962 LanciaA Delta 16V,38,131.49
2995,10425,2005-05-31,13,1940s Ford truck,38,107.76

In [ ]:
#101
runSELECT("SELECT orderNumber, orderDate, customerName, orderLineNumber, productName, quantityOrdered, priceEach FROM orders INNER JOIN orderdetails USING (orderNumber) INNER JOIN products USING (productCode) INNER JOIN customers USING (customerNumber) ORDER BY orderNumber, orderLineNumber")

,orderNumber,orderDate,customerName,orderLineNumber,productName,quantityOrdered,priceEach
0,10100,2003-01-06,Online Diecast Creations Co.,1,1936 Mercedes Benz 500k Roadster,49,35.29
1,10100,2003-01-06,Online Diecast Creations Co.,2,1911 Ford Town Car,50,55.09
2,10100,2003-01-06,Online Diecast Creations Co.,3,1917 Grand Touring Sedan,30,136.00
3,10100,2003-01-06,Online Diecast Creations Co.,4,1932 Alfa Romeo 8C2300 Spider Sport,22,75.46
4,10101,2003-01-09,"Blauer See Auto, Co.",1,1928 Mercedes-Benz SSK,26,167.06
...,...,...,...,...,...,...,...
2991,10425,2005-05-31,La Rochelle Gifts,9,1962 Volkswagen Microbus,49,127.79
2992,10425,2005-05-31,La Rochelle Gifts,10,1926 Ford Fire Engine,19,48.62
2993,10425,2005-05-31,La Rochelle Gifts,11,1980’s GM Manhattan Express,41,83.79
2994,10425,2005-05-31,La Rochelle Gifts,12,1962 LanciaA Delta 16V,38,131.49
2995,10425,2005-05-31,La Rochelle Gifts,13,1940s Ford truck,38,107.76

In [ ]:
#102
runSELECT("SELECT orderNumber, productName, msrp, priceEach FROM products p INNER JOIN orderdetails o ON p.productcode = o.productcode AND p.msrp > o.priceEach WHERE p.productcode = 'S10_1678'")

    orderNumber                            productName  msrp  priceEach
0         10107  1969 Harley Davidson Ultimate Chopper  95.7      81.35
1         10121  1969 Harley Davidson Ultimate Chopper  95.7      86.13
2         10134  1969 Harley Davidson Ultimate Chopper  95.7      90.92
3         10145  1969 Harley Davidson Ultimate Chopper  95.7      76.56
4         10159  1969 Harley Davidson Ultimate Chopper  95.7      81.35
5         10168  1969 Harley Davidson Ultimate Chopper  95.7      94.74
6         10180  1969 Harley Davidson Ultimate Chopper  95.7      76.56
7         10201  1969 Harley Davidson Ultimate Chopper  95.7      82.30
8         10211  1969 Harley Davidson Ultimate Chopper  95.7      90.92
9         10223  1969 Harley Davidson Ultimate Chopper  95.7      80.39
10        10237  1969 Harley Davidson Ultimate Chopper  95.7      91.87
11        10251  1969 Harley Davidson Ultimate Chopper  95.7      93.79
12        10263  1969 Harley Davidson Ultimate Chopper  95.7      89.00
13        10275  1969 Harley Davidson Ultimate Chopper  95.7      81.35
14        10299  1969 Harley Davidson Ultimate Chopper  95.7      76.56
15        10309  1969 Harley Davidson Ultimate Chopper  95.7      94.74
16        10318  1969 Harley Davidson Ultimate Chopper  95.7      84.22
17        10329  1969 Harley Davidson Ultimate Chopper  95.7      80.39
18        10341  1969 Harley Davidson Ultimate Chopper  95.7      84.22
19        10354  1969 Harley Davidson Ultimate Chopper  95.7      84.22
20        10361  1969 Harley Davidson Ultimate Chopper  95.7      92.83
21        10375  1969 Harley Davidson Ultimate Chopper  95.7      76.56
22        10388  1969 Harley Davidson Ultimate Chopper  95.7      80.39
23        10399  1969 Harley Davidson Ultimate Chopper  95.7      77.52
24        10403  1969 Harley Davidson Ultimate Chopper  95.7      85.17
25        10417  1969 Harley Davidson Ultimate Chopper  95.7      79.43

## LEFT JOIN

In [ ]:
#103
# 1) Using MySQL LEFT JOIN clause to join two tables

runSELECT("SELECT customers.customerNumber, customerName, orderNumber, status FROM customers LEFT JOIN orders ON orders.customerNumber = customers.customerNumber")

     customerNumber          customerName  orderNumber     status
0               103     Atelier graphique      10123.0    Shipped
1               103     Atelier graphique      10298.0    Shipped
2               103     Atelier graphique      10345.0    Shipped
3               112    Signal Gift Stores      10124.0    Shipped
4               112    Signal Gift Stores      10278.0    Shipped
..              ...                   ...          ...        ...
345             495  Diecast Collectables      10243.0    Shipped
346             496     Kelly's Gift Shop      10138.0    Shipped
347             496     Kelly's Gift Shop      10179.0  Cancelled
348             496     Kelly's Gift Shop      10360.0    Shipped
349             496     Kelly's Gift Shop      10399.0    Shipped

[350 rows x 4 columns]

In [ ]:
#104
runSELECT("SELECT c.customerNumber, customerName, orderNumber, status FROM customers c LEFT JOIN orders o ON c.customerNumber = o.customerNumber")

     customerNumber          customerName  orderNumber     status
0               103     Atelier graphique      10123.0    Shipped
1               103     Atelier graphique      10298.0    Shipped
2               103     Atelier graphique      10345.0    Shipped
3               112    Signal Gift Stores      10124.0    Shipped
4               112    Signal Gift Stores      10278.0    Shipped
..              ...                   ...          ...        ...
345             495  Diecast Collectables      10243.0    Shipped
346             496     Kelly's Gift Shop      10138.0    Shipped
347             496     Kelly's Gift Shop      10179.0  Cancelled
348             496     Kelly's Gift Shop      10360.0    Shipped
349             496     Kelly's Gift Shop      10399.0    Shipped

[350 rows x 4 columns]

In [ ]:
#105
runSELECT("SELECT customerNumber, CustomerName, orderNumber, status FROM customers LEFT JOIN orders USING (customerNumber)")

     customerNumber          CustomerName  orderNumber     status
0               103     Atelier graphique      10123.0    Shipped
1               103     Atelier graphique      10298.0    Shipped
2               103     Atelier graphique      10345.0    Shipped
3               112    Signal Gift Stores      10124.0    Shipped
4               112    Signal Gift Stores      10278.0    Shipped
..              ...                   ...          ...        ...
345             495  Diecast Collectables      10243.0    Shipped
346             496     Kelly's Gift Shop      10138.0    Shipped
347             496     Kelly's Gift Shop      10179.0  Cancelled
348             496     Kelly's Gift Shop      10360.0    Shipped
349             496     Kelly's Gift Shop      10399.0    Shipped

[350 rows x 4 columns]

In [ ]:
#106
runSELECT("SELECT c.customerNumber, c.customerName, o.orderNumber, o.status FROM customers c LEFT JOIN orders o ON c.customerNumber = o.customerNumber WHERE orderNumber IS NULL")

    customerNumber                    customerName orderNumber status
0              125              Havel & Zbyszek Co        None   None
1              168          American Souvenirs Inc        None   None
2              169               Porto Imports Co.        None   None
3              206      Asian Shopping Network, Co        None   None
4              223                 Natürlich Autos        None   None
5              237                   ANG Resellers        None   None
6              247        Messner Shopping Network        None   None
7              273               Franken Gifts, Co        None   None
8              293               BG&E Collectables        None   None
9              303                Schuyler Imports        None   None
10             307                Der Hund Imports        None   None
11             335       Cramer Spezialitäten, Ltd        None   None
12             348           Asian Treasures, Inc.        None   None
13             356            SAR Distributors, Co        None   None
14             361                 Kommission Auto        None   None
15             369          Lisboa Souveniers, Inc        None   None
16             376           Precious Collectables        None   None
17             409  Stuttgart Collectable Exchange        None   None
18             443        Feuer Online Stores, Inc        None   None
19             459                Warburg Exchange        None   None
20             465             Anton Designs, Ltd.        None   None
21             477             Mit Vergnügen & Co.        None   None
22             480       Kremlin Collectables, Co.        None   None
23             481              Raanan Stores, Inc        None   None

In [ ]:
#107
runSELECT("SELECT lastName, firstName, customerName, checkNumber, amount FROM employees LEFT JOIN customers ON employeeNumber = salesRepEmployeeNumber LEFT JOIN payments ON payments.customerNumber = customers.customerNumber ORDER BY customerName, checkNumber")

      lastName firstName                 customerName checkNumber    amount
0     Firrelli      Jeff                         None        None       NaN
1    Patterson      Mary                         None        None       NaN
2         Kato   Yoshimi                         None        None       NaN
3       Murphy     Diane                         None        None       NaN
4          Bow   Anthony                         None        None       NaN
..         ...       ...                          ...         ...       ...
278      Tseng  Foon Yue              Vitachrome Inc.    OH367219  44400.50
279      Jones     Barry     Volvo Model Replicas, Co    IR846303  36005.71
280      Jones     Barry     Volvo Model Replicas, Co    LA685678   7674.94
281   Thompson    Leslie  West Coast Collectables Co.    JP113227   7678.25
282   Thompson    Leslie  West Coast Collectables Co.    PB951268  36070.47

[283 rows x 5 columns]

## RIGHT JOIN

In [ ]:
#108
# 1) Simple MySQL RIGHT JOIN example

runSELECT("SELECT employeeNumber, customerNumber FROM customers RIGHT JOIN employees ON salesRepEmployeeNumber = employeeNumber ORDER BY employeeNumber")

     employeeNumber  customerNumber
0              1002             NaN
1              1056             NaN
2              1076             NaN
3              1088             NaN
4              1102             NaN
..              ...             ...
103            1702           298.0
104            1702           344.0
105            1702           376.0
106            1702           458.0
107            1702           484.0

[108 rows x 2 columns]

In [ ]:
#109
# 2) Using MySQL RIGHT JOIN to find unmatching rows

runSELECT("SELECT employeeNumber, customerNumber FROM customers RIGHT JOIN employees ON salesRepEmployeeNumber = employeeNumber WHERE customerNumber is NULL ORDER BY employeeNumber")

   employeeNumber customerNumber
0            1002           None
1            1056           None
2            1076           None
3            1088           None
4            1102           None
5            1143           None
6            1619           None
7            1625           None

## CROSS JOIN

In [ ]:
#110
!mysql -e "CREATE DATABASE IF NOT EXISTS salesdb;"

In [ ]:
#111
!mysql -e "show databases"

+--------------------+
| Database           |
+--------------------+
| information_schema |
| classicmodels      |
| mysql              |
| performance_schema |
| sys                |
+--------------------+

In [ ]:
#112
!mysql salesdb -e "CREATE TABLE products (id INT PRIMARY KEY AUTO_INCREMENT, product_name VARCHAR(100), price DECIMAL(13,2 ));"

ERROR 1049 (42000): Unknown database 'salesdb'

In [ ]:
#113
!mysql salesdb -e "CREATE TABLE stores (id INT PRIMARY KEY AUTO_INCREMENT, store_name VARCHAR(100));"

ERROR 1049 (42000): Unknown database 'salesdb'

In [ ]:
#114
!mysql salesdb -e "CREATE TABLE sales (product_id INT, store_id INT, quantity DECIMAL(13 , 2 ) NOT NULL, sales_date DATE NOT NULL, PRIMARY KEY (product_id , store_id), FOREIGN KEY (product_id) REFERENCES products (id) ON DELETE CASCADE ON UPDATE CASCADE, FOREIGN KEY (store_id) REFERENCES stores (id) ON DELETE CASCADE ON UPDATE CASCADE)"

ERROR 1049 (42000): Unknown database 'salesdb'

In [ ]:
#115
!mysql salesdb -e "INSERT INTO products(product_name, price) VALUES('iPhone', 699),('iPad',599),('Macbook Pro',1299)"

ERROR 1049 (42000): Unknown database 'salesdb'

In [ ]:
#116
!mysql salesdb -e "INSERT INTO stores(store_name) VALUES('North'),('South');"

ERROR 1049 (42000): Unknown database 'salesdb'

In [ ]:
#117
!mysql salesdb -e "INSERT INTO sales(store_id,product_id,quantity,sales_date) VALUES(1,1,20,'2017-01-02'),(1,2,15,'2017-01-05'),(1,3,25,'2017-01-05'),(2,1,30,'2017-01-02'),(2,2,35,'2017-01-05');"

ERROR 1049 (42000): Unknown database 'salesdb'

In [ ]:
#118
#To run any non-SELECT SQL command
def runCMD (DDL):
    #DBConn= MySQLdb.connect(hostName,userName,passWord,dbName)
    DBConn= MySQLdb.connect(db='salesdb')  # since local MySQL server, userid, password not needed
    myCursor = DBConn.cursor()
    retcode = myCursor.execute(DDL) 
    print (retcode)
    DBConn.commit()
    DBConn.close()

#To run any SELECT SQL command
def runSELECT (CMD):
    #DBConn= MySQLdb.connect(hostName,userName,passWord,dbName)
    DBConn= MySQLdb.connect(db='salesdb') # since local MySQL server, userid, password not needed
    df_mysql = pd.read_sql(CMD, con=DBConn)    
    DBConn.close()
    return df_mysql

In [ ]:
#119
runSELECT("SELECT store_name, product_name, SUM(quantity * price) AS revenue FROM sales INNER JOIN products ON products.id = sales.product_id INNER JOIN stores ON stores.id = sales.store_id GROUP BY store_name , product_name;")

DatabaseError: ignored

In [ ]:
#120
runSELECT("SELECT store_name, product_name FROM stores AS a CROSS JOIN products AS b;")

DatabaseError: ignored

In [ ]:
#121
runSELECT("Select b.store_name, a.product_name, IFNULL(c.revenue, 0) AS revenue from products AS a CROSS JOIN stores AS b LEFT JOIN (SELECT stores.id AS store_id, products.id AS product_id, store_name, product_name, ROUND(SUM(quantity * price), 0) AS revenue FROM sales INNER JOIN products ON products.id = sales.product_id INNER JOIN stores ON stores.id = sales.store_id GROUP BY stores.id, products.id, store_name , product_name) AS c ON c.store_id = b.id AND c.product_id= a.id ORDER BY b.store_name;")

DatabaseError: ignored

## SELF JOIN

In [ ]:
#122
#1) MySQL self join using INNER JOIN clause
runSELECT("SELECT CONCAT(m.lastName, ', ', m.firstName) AS Manager, CONCAT(e.lastName, ', ', e.firstName) AS 'Direct report' FROM employees e INNER JOIN employees m ON m.employeeNumber = e.reportsTo ORDER BY Manager;")

DatabaseError: ignored

In [ ]:
#123
#2) MySQL self join using LEFT JOIN clause
runSELECT("SELECT IFNULL(CONCAT(m.lastname, ', ', m.firstname),'Top Manager') AS 'Manager', CONCAT(e.lastname, ', ', e.firstname) AS 'Direct report' FROM employees e LEFT JOIN employees m ON m.employeeNumber = e.reportsto ORDER BY manager DESC;")

DatabaseError: ignored

In [ ]:
#124
#3) Using MySQL self join to compare successive rows
runSELECT("SELECT c1.city, c1.customerName, c2.customerName FROM customers c1 INNER JOIN customers c2 ON c1.city = c2.city AND c1.customername > c2.customerName ORDER BY c1.city;")

# Section 5. Grouping data

## Group By

In [ ]:
#125
#A) Simple MySQL GROUP BY example
runSELECT('SELECT status FROM orders GROUP BY status')

In [ ]:
#126
runSELECT('SELECT DISTINCT status FROM orders')

In [ ]:
#127
runSELECT('SELECT status, COUNT(*) FROM orders GROUP BY status')

In [ ]:
#128
#function to calculate the total amount.
runSELECT('SELECT status,SUM(quantityOrdered * priceEach) AS amount FROM orders INNER JOIN orderdetails USING (orderNumber) GROUP BY status')

In [ ]:
#129
#Similarly, the following query returns the order numbers and the total amount of each order.
runSELECT('SELECT orderNumber,SUM(quantityOrdered * priceEach) AS total FROM orderdetails GROUP BY orderNumber')

In [ ]:
#130
#C) MySQL GROUP BY with expression example
runSELECT('SELECT YEAR(orderDate) AS year, SUM(quantityOrdered * priceEach) AS total FROM orders INNER JOIN orderdetails  USING (orderNumber) WHERE status = "Shipped" GROUP BY YEAR(orderDate)')

In [ ]:
#131
#D) Using MySQL GROUP BY with HAVING clause example
runSELECT('SELECT YEAR(orderDate) AS year, SUM(quantityOrdered * priceEach) AS total FROM orders INNER JOIN orderdetails USING (orderNumber) WHERE status = "Shipped" GROUP BY year HAVING year > 2003')

In [ ]:
#132
runSELECT('SELECT YEAR(orderDate) AS year, COUNT(orderNumber) FROM orders GROUP BY year')

In [ ]:
#133
runSELECT('Select status ,COUNT(*) \
FROM orders \
GROUP BY status DESC')

In [ ]:
#134
runSELECT('SELECT state FROM customers GROUP BY state')

In [ ]:
#135
runSELECT('SELECT DISTINCT state FROM customers')

In [ ]:
#136
runSELECT('SELECT DISTINCT state \
FROM customers \
ORDER BY state')

## HAVING

In [ ]:
#137
runSELECT('SELECT ordernumber,SUM(quantityOrdered) AS itemsCount,SUM(priceeach*quantityOrdered) AS total FROM orderdetails GROUP BY ordernumber')

In [ ]:
#138
runSELECT('SELECT ordernumber,SUM(quantityOrdered) AS itemsCount,SUM(priceeach*quantityOrdered) AS total FROM orderdetails GROUP BY  ordernumber HAVING total > 1000')

In [ ]:
#139
runSELECT('SELECT ordernumber,SUM(quantityOrdered) AS itemsCount, SUM(priceeach*quantityOrdered) AS total FROM orderdetails GROUP BY ordernumber HAVING total > 1000 AND itemsCount > 600')

In [ ]:
#140
runSELECT('SELECT a.ordernumber, status, SUM(priceeach*quantityOrdered) total FROM orderdetails a INNER JOIN orders b ON b.ordernumber = a.ordernumber GROUP BY ordernumber,  status HAVING status = "Shipped" AND total > 1500')

## ROLLUP

In [ ]:
#141
!mysql classicmodels -e 'CREATE TABLE sales SELECT productLine, YEAR(orderDate) orderYear, SUM(quantityOrdered * priceEach) orderValue \
FROM orderdetails \
INNER JOIN orders USING (orderNumber) \
INNER JOIN products USING (productCode) \
GROUP BY productLine , YEAR(orderDate)'

In [ ]:
#142
runSELECT('SELECT * FROM sales')

In [ ]:
#143
runSELECT('SELECT productline, SUM(orderValue) totalOrderValue \
FROM sales \
GROUP BY productline ')

In [ ]:
#144
runSELECT('SELECT SUM(orderValue) totalOrderValue \
FROM sales')

In [ ]:
#145
runSELECT('SELECT productline, SUM(orderValue) totalOrderValue FROM sales GROUP BY  productline UNION ALL SELECT NULL, SUM(orderValue) totalOrderValue FROM sales')

In [ ]:
#146
runSELECT('SELECT productLine,SUM(orderValue) totalOrderValue FROM sales GROUP BY productline WITH ROLLUP')

In [ ]:
#147
runSELECT('SELECT productLine,orderYear,SUM(orderValue) totalOrderValue \
FROM sales \
GROUP BY productline,orderYear WITH ROLLUP')

# Section 6. Subqueries

## SUBQUERY

In [ ]:
#148
##Using a MySQL subquery in the WHERE clause
runSELECT('SELECT customerNumber,checkNumber,amount FROM payments WHERE amount = (SELECT MAX(amount) FROM payments)')

In [ ]:
#149
runSELECT('SELECT customerNumber,checkNumber, amount FROM payments WHERE amount > (SELECT  AVG(amount) FROM payments)')

In [ ]:
#150
##MySQL subquery with IN and NOT IN operators
runSELECT('SELECT customerName FROM customers WHERE customerNumber NOT IN (SELECT DISTINCT customerNumber FROM orders)')

In [ ]:
#151
## MySQL subquery in the FROM clause
runSELECT('SELECT MAX(items), MIN(items),FLOOR(AVG(items)) FROM (SELECT orderNumber, COUNT(orderNumber) AS items FROM orderdetails GROUP BY orderNumber) AS lineitems')

In [ ]:
#152
##MySQL correlated subquery
runSELECT('SELECT orderNumber,COUNT(orderNumber) AS items FROM orderdetails GROUP BY orderNumber')

In [ ]:
#153
runSELECT('SELECT productname,buyprice FROM products p1 WHERE buyprice > (SELECT  AVG(buyprice) FROM products WHERE productline = p1.productline)')

In [ ]:
#154
#MySQL subquery with EXISTS and NOT EXISTS
runSELECT('SELECT orderNumber,SUM(priceEach * quantityOrdered) total FROM orderdetails INNER JOIN orders USING (orderNumber) GROUP BY orderNumber HAVING SUM(priceEach * quantityOrdered) > 60000;')

In [ ]:
#155
runSELECT('SELECT customerNumber, customerName FROM customers WHERE EXISTS( SELECT orderNumber, SUM(priceEach * quantityOrdered) FROM orderdetails INNER JOIN orders USING (orderNumber) WHERE customerNumber = customers.customerNumber GROUP BY orderNumber HAVING SUM(priceEach * quantityOrdered) > 60000)')

## Derived Tables

In [ ]:
#156
## SQL derived table
runSELECT('SELECT productCode, ROUND(SUM(quantityOrdered * priceEach)) sales FROM orderdetails INNER JOIN orders USING (orderNumber) WHERE YEAR(shippedDate) = 2003 GROUP BY productCode ORDER BY sales DESC LIMIT 5')

In [ ]:
#157
runSELECT('SELECT productName, sales FROM (SELECT productCode,ROUND(SUM(quantityOrdered * priceEach)) sales FROM orderdetails INNER JOIN orders USING (orderNumber) WHERE YEAR(shippedDate) = 2003 GROUP BY productCode ORDER BY sales DESC LIMIT 5) top5products2003 INNER JOIN products USING (productCode)')

In [ ]:
#158
# A more complex MySQL derived table
runSELECT('SELECT customerNumber,ROUND(SUM(quantityOrdered * priceEach)) sales,(CASE WHEN SUM(quantityOrdered * priceEach) < 10000 THEN "Silver" WHEN SUM(quantityOrdered * priceEach) BETWEEN 10000 AND 100000 THEN "Gold" WHEN SUM(quantityOrdered * priceEach) > 100000 THEN "Platinum" END) customerGroup FROM orderdetails INNER JOIN orders USING (orderNumber) WHERE YEAR(shippedDate) = 2003 GROUP BY customerNumber')

In [ ]:
#159
runSELECT('SELECT customerGroup, COUNT(cg.customerGroup) AS groupCount FROM (SELECT customerNumber, ROUND(SUM(quantityOrdered * priceEach)) sales, (CASE WHEN SUM(quantityOrdered * priceEach) < 10000 THEN "Silver" WHEN SUM(quantityOrdered * priceEach) BETWEEN 10000 AND 100000 THEN "Gold" WHEN SUM(quantityOrdered * priceEach) > 100000 THEN "Platinum" END) customerGroup FROM orderdetails INNER JOIN orders USING (orderNumber) WHERE YEAR(shippedDate) = 2003 GROUP BY customerNumber) cg GROUP BY cg.customerGroup')

## EXISTS

In [ ]:
#160
# MySQL SELECT EXISTS
runSELECT('SELECT customerNumber,customerName FROM customers WHERE EXISTS( SELECT 1 FROM orders WHERE orders.customernumber = customers.customernumber)')

In [ ]:
#161
runSELECT('SELECT customerNumber, customerName FROM customers WHERE NOT EXISTS( SELECT 1 FROM orders WHERE orders.customernumber = customers.customernumber)')

In [ ]:
#162
#MySQL UPDATE EXISTS
runSELECT('SELECT employeenumber, firstname, lastname, extension FROM employees WHERE EXISTS( SELECT 1 FROM offices WHERE city = "San Francisco" AND offices.officeCode = employees.officeCode)')

In [ ]:
#163
!mysql classicmodels -e 'CREATE TABLE IF NOT EXISTS customers_archive LIKE customers'

In [ ]:
#164
#!mysql classicmodels -e 'INSERT customers_archiv 
runSELECT('SELECT * FROM customers WHERE NOT EXISTS( SELECT 1 FROM orders WHERE orders.customernumber = customers.customernumber)')

In [ ]:
#166
runSELECT('SELECT * FROM customers')

In [ ]:
#167
# MySQL DELETE EXISTS
runSELECT('SELECT customerNumber, customerName FROM customers WHERE customerNumber IN ( SELECT  customerNumber FROM orders)')

In [ ]:
#168
#check the performance of the query that uses the IN operator.
runSELECT('SELECT customerNumber, customerName FROM customers WHERE customerNumber IN (SELECT  customerNumber FROM orders)')

In [ ]:
#169
#the following statement uses the IN operator selects all employees who work at the office in San Francisco.
runSELECT('SELECT employeenumber, firstname, lastname FROM employees WHERE officeCode IN (SELECT officeCode FROM offices WHERE offices.city = "San Francisco")')

# Section 7. Common Table Expressions

## Common Table Expression or CTE

In [ ]:
#170
!mysql classicmodels -e " \
SELECT customerName \
 FROM \
    (select customerName, state from  customers \
     where country = 'USA'\
     ) as customers_in_usa \
 WHERE state = 'CA' ORDER BY customerName \
"

In [ ]:
#171
runSELECT("WITH cte_name (column_list) AS (query) SELECT * FROM cte_name;")

In [ ]:
#172
runSELECT("WITH customers_in_usa AS (SELECT customerName, state FROM customers WHERE country = 'USA') SELECT customerName FROM customers_in_usa WHERE state = 'CA' ORDER BY customerName;")

In [ ]:
#173
runSELECT("WITH topsales2003 AS (SELECT salesRepEmployeeNumber employeeNumber,SUM(quantityOrdered * priceEach) sales FROM orders INNER JOIN orderdetails USING (orderNumber) INNER JOIN customers USING (customerNumber) WHERE YEAR(shippedDate) = 2003 AND status = 'Shipped' GROUP BY salesRepEmployeeNumber ORDER BY sales DESC LIMIT 5) SELECT employeeNumber, firstName, lastName, sales FROM employees JOIN topsales2003 USING (employeeNumber)")

In [ ]:
#174
runSELECT("WITH salesrep AS (SELECT employeeNumber, CONCAT(firstName, ' ', lastName) AS salesrepName FROM employees WHERE jobTitle = 'Sales Rep'), customer_salesrep AS (SELECT customerName, salesrepName FROM customers INNER JOIN salesrep ON employeeNumber = salesrepEmployeeNumber) SELECT * FROM customer_salesrep ORDER BY customerName")

## Recursive CTE

In [ ]:
#175
runSELECT("WITH RECURSIVE cte_name AS (initial_query  -- anchor member UNION ALL recursive_query -- recursive member that references to the CTE name) SELECT * FROM cte_name;")

In [ ]:
176
runSELECT("WITH RECURSIVE cte_count (n) AS (SELECT 1 UNION ALL SELECT n + 1 FROM cte_count WHERE n < 3) SELECT n FROM cte_count")

In [ ]:
#177
runSELECT("SELECT n + 1 FROM cte_count WHERE n < 3")

In [ ]:
#178
runSELECT("WITH RECURSIVE employee_paths AS ( SELECT employeeNumber, reportsTo managerNumber, officeCode, 1 lvl FROM employees WHERE reportsTo IS NULL UNION ALL SELECT e.employeeNumber, e.reportsTo, e.officeCode, lvl+1 FROM employees e INNER JOIN employee_paths ep ON ep.employeeNumber = e.reportsTo ) SELECT employeeNumber, managerNumber, lvl, city FROM employee_paths ep INNER JOIN offices o USING (officeCode) ORDER BY lvl, city;")"

In [ ]:
#179
runSELECT("SELECT employeeNumber, reportsTo managerNumber, officeCode FROM employees WHERE reportsTo IS NULL")

In [ ]:
#180
runSELECT("SELECT e.employeeNumber, e.reportsTo, e.officeCode FROM employees e INNER JOIN employee_paths ep ON ep.employeeNumber = e.reportsTo")

# Section 8. Set operators

## UNION AND UNION ALL

In [ ]:
#181
!mysql classicmodels -e 'DROP TABLE IF EXISTS t1'
!mysql classicmodels -e 'DROP TABLE IF EXISTS t2'

In [ ]:
#182
!mysql classicmodels -e 'CREATE TABLE IF NOT EXISTS t1 (id INT PRIMARY KEY)'

In [ ]:
#183
!mysql classicmodels -e 'CREATE TABLE IF NOT EXISTS t2 (id INT PRIMARY KEY)'

In [ ]:
#184
!mysql classicmodels -e 'INSERT INTO t1 VALUES (1),(2),(3)'

In [ ]:
#185
!mysql classicmodels -e 'INSERT INTO t2 VALUES (2),(3),(4)'

In [ ]:
#186
# The following statement combines result sets returned from t1 and t2 tables:

runSELECT("SELECT id \
FROM t1 \
UNION \
SELECT id \
FROM t2")

In [ ]:
#187
# If you use the UNION ALL explicitly, the duplicate rows, if available, remain in the result. Because UNION ALL does not need to handle duplicates, it performs faster than UNION DISTINCT .

runSELECT("SELECT id \
FROM t1 \
UNION ALL \
SELECT id \
FROM t2")

In [ ]:
#188
# Suppose that you want to combine the first name and last name of employees and customers into a single result set, you can use the UNION operator as follows:

runSELECT("SELECT firstName, lastName FROM employees UNION SELECT contactFirstName, contactLastName FROM customers")

In [ ]:
#189
# If you want to use other column headings, you need to use column aliases explicitly in the first SELECT statement as shown in the following example:

runSELECT("SELECT CONCAT(firstName,' ',lastName) fullname FROM employees UNION SELECT CONCAT(contactFirstName,' ',contactLastName) FROM customers")

In [ ]:
#190
# MySQL UNION and ORDER BY

runSELECT("SELECT concat(firstName,' ',lastName) fullname FROM employees UNION SELECT concat(contactFirstName,' ',contactLastName) FROM customers ORDER BY fullname")

In [ ]:
#191
# To differentiate between employees and customers, you can add a column as shown in the following query:

runSELECT("SELECT CONCAT(firstName, ' ', lastName) fullname, 'Employee' as contactType FROM employees UNION SELECT CONCAT(contactFirstName, ' ', contactLastName), 'Customer' as contactType FROM customers ORDER BY fullname")

In [ ]:
#192
# MySQL also provides you with an alternative option to sort a result set based on column position using ORDER BY clause as follows:

runSELECT("SELECT CONCAT(firstName,' ',lastName) fullname FROM employees UNION SELECT CONCAT(contactFirstName,' ',contactLastName) FROM customers ORDER BY 1")

## INTERSECT

In [ ]:
#193
# The following query returns rows from the t1 table.

runSELECT("SELECT id FROM t1")

In [ ]:
#194
# The following query returns the rows from the t2 table:

runSELECT("SELECT id FROM t2")

In [ ]:
#195
# 1) Emulate INTERSECT using DISTINCT and INNER JOIN clause

runSELECT("SELECT DISTINCT id FROM t1 INNER JOIN t2 USING(id)")

In [ ]:
#196
# 2) Emulate INTERSECT using IN and subquery

runSELECT("SELECT DISTINCT id FROM t1 WHERE id IN (SELECT id FROM t2)")

## MINUS

In [ ]:
#197
runSELECT("SELECT id FROM t1 MINUS SELECT id FROM t2")

In [ ]:
#198
# MySQL MINUS operator emulation

runSELECT("SELECT id FROM t1 LEFT JOIN t2 USING (id) WHERE t2.id IS NULL")

#Section 9. Modifying data in MySQL

## INSERT

In [ ]:
#199
!mysql classicmodels -e 'DROP TABLE IF EXISTS tasks'

In [ ]:
#200
# !mysql classicmodels -e 'CREATE TABLE IF NOT EXISTS t1 (id INT PRIMARY KEY)'
!mysql classicmodels -e 'CREATE TABLE IF NOT EXISTS tasks (task_id INT AUTO_INCREMENT, title VARCHAR(255) NOT NULL, start_date DATE, due_date DATE, priority TINYINT NOT NULL DEFAULT 3, description TEXT, PRIMARY KEY (task_id))'

In [ ]:
#201
# 1) MySQL INSERT – simple INSERT example

!mysql classicmodels -e "INSERT INTO tasks(title,priority) VALUES('Learn MySQL INSERT Statement',1);"

In [ ]:
#202
# This query returns data from the tasks table:

runSELECT("SELECT * FROM tasks")

In [ ]:
#203
# 2) MySQL INSERT – Inserting rows using default value example

!mysql classicmodels -e "INSERT INTO tasks(title,priority) VALUES('Understanding DEFAULT keyword in INSERT statement',DEFAULT)"

In [ ]:
#204
# The following statement returns the contents of the tasks table after the insert:

runSELECT("SELECT * FROM tasks")

In [ ]:
#205
# 3) MySQL INSERT – Inserting dates into the table example

!mysql classicmodels -e "INSERT INTO tasks(title, start_date, due_date) VALUES('Insert date into table','2018-01-09','2018-09-15')"

In [ ]:
#206

!mysql classicmodels -e "INSERT INTO tasks(title,start_date,due_date) VALUES('Use current date for the task',CURRENT_DATE(),CURRENT_DATE())"

In [ ]:
#207
runSELECT("select * from tasks")

In [ ]:
#208
# 4) MySQL INSERT – Inserting multiple rows example

!mysql classicmodels -e "INSERT INTO tasks(title, priority) VALUES ('My first task', 1), ('It is the second task',2), ('This is the third task of the week',3)"

In [ ]:
#209
runSELECT("SELECT * FROM tasks")

## Insert Multiple Rows

In [ ]:
#210
!mysql classicmodels -e 'CREATE TABLE projects(project_id INT AUTO_INCREMENT, \
	name VARCHAR(100) NOT NULL, \
	start_date DATE, \
	end_date DATE, \
	PRIMARY KEY(project_id) \
)'

In [ ]:
#211
!mysql classicmodels -e "INSERT INTO projects(name, start_date, end_date) VALUES \
	('AI for Marketing','2019-08-01','2019-12-31'), \
	('ML for Sales','2019-05-15','2019-11-20')"

In [ ]:
#212
runSELECT("SELECT * FROM projects")

## INSERT INTO SELECT

In [ ]:
#213
# MySQL INSERT INTO SELECT example

!mysql classicmodels -e "CREATE TABLE suppliers ( \
    supplierNumber INT AUTO_INCREMENT, \
    supplierName VARCHAR(50) NOT NULL, \
    phone VARCHAR(50), \
    addressLine1 VARCHAR(50), \
    addressLine2 VARCHAR(50), \
    city VARCHAR(50), \
    state VARCHAR(50), \
    postalCode VARCHAR(50), \
    country VARCHAR(50), \
    customerNumber INT, \
    PRIMARY KEY (supplierNumber) \
)"

In [ ]:
#214
# Suppose all customers from California, USA become the company’s suppliers. The following query finds all customers who locate in California, USA:

runSELECT("SELECT customerNumber, customerName, phone, addressLine1, addressLine2, city, state, postalCode, country FROM customers WHERE country = 'USA' AND state = 'CA'")

In [ ]:
#215
runSELECT("SELECT customerName, phone, addressLine1, addressLine2, city, state , postalCode, country, customerNumber FROM customers WHERE country = 'USA' AND state = 'CA'")

In [ ]:
#216
runSELECT("SELECT * FROM suppliers")

In [ ]:
#217
# Using SELECT statement in the VALUES list

!mysql classicmodels -e "CREATE TABLE stats (totalProduct INT, totalCustomer INT, totalOrder INT)"

In [ ]:
#218
!mysql classicmodels -e "INSERT INTO stats(totalProduct, totalCustomer, totalOrder) VALUES( \
(SELECT COUNT(*) FROM products), \
(SELECT COUNT(*) FROM customers), \
(SELECT COUNT(*) FROM orders))"

In [ ]:
#219
runSELECT("SELECT * FROM stats")

## INSERT IGNORE

In [ ]:
#220
!mysql classicmodels -e 'DROP TABLE IF EXISTS subscribers'

In [ ]:
#221
!mysql classicmodels -e "CREATE TABLE subscribers (id INT PRIMARY KEY AUTO_INCREMENT, email VARCHAR(50) NOT NULL UNIQUE)"

In [ ]:
#222
!mysql classicmodels -e "INSERT INTO subscribers(email) VALUES('john.doe@gmail.com')"

In [ ]:
#223
!mysql classicmodels -e "INSERT INTO subscribers(email) VALUES('john.doe@gmail.com'), ('jane.smith@ibm.com')"

In [ ]:
#224
!mysql classicmodels -e "INSERT IGNORE INTO subscribers(email) VALUES('john.doe@gmail.com'), ('jane.smith@ibm.com')"

In [ ]:
#225
runSELECT("SHOW WARNINGS")

In [ ]:
#226
!mysql classicmodels -e "CREATE TABLE tokens (s VARCHAR(6))"

In [ ]:
#227
!mysql classicmodels -e "INSERT INTO tokens VALUES('abcdefg')"

In [ ]:
#228
!mysql classicmodels -e "INSERT IGNORE INTO tokens VALUES('abcdefg')"

In [ ]:
#229
runSELECT("show warnings")

## UPDATE

In [ ]:
#230
#1) Using MySQL UPDATE to modify values in a single column example

runSELECT('SELECT firstname, lastname, email \
FROM employees \
WHERE employeeNumber = 1056')

In [ ]:
#231
!mysql classicmodels -e 'UPDATE employees SET email = "mary.patterson@classicmodelcars.com" WHERE employeeNumber = 1056'

In [ ]:
#232
runSELECT('SELECT firstname, lastname, email \
FROM employees \
WHERE employeeNumber = 1056')

In [ ]:
#233
#2) Using MySQL UPDATE to modify values in multiple columns
!mysql classicmodels -e UPDATE employees SET lastname = "Hill", email = "mary.hill@classicmodelcars.com" WHERE employeeNumber = 1056'

In [ ]:
#234
runSELECT('SELECT firstname, lastname, email \
FROM employees \
WHERE employeeNumber = 1056')

In [ ]:
#235
#3) Using MySQL UPDATE to replace string example
!mysql classicmodels -e "UPDATE employees SET email = REPLACE(email,'@classicmodelcars.com','@mysqltutorial.org') WHERE jobTitle = 'Sales Rep' AND officeCode = 6"

In [ ]:
#236
#4) Using MySQL UPDATE to update rows returned by a SELECT statement example
runSELECT('SELECT customername,salesRepEmployeeNumber \
FROM customers \
WHERE salesRepEmployeeNumber IS NULL')

In [ ]:
#237
runSELECT('SELECT employeeNumber \
FROM employees \
WHERE jobtitle = "Sales Rep" \
ORDER BY RAND() \
LIMIT 1')

In [ ]:
#238
!mysql classicmodels -e "UPDATE customers SET salesRepEmployeeNumber = (SELECT employeeNumber FROM employees WHERE jobtitle = 'Sales Rep' ORDER BY RAND() LIMIT 1) \
WHERE salesRepEmployeeNumber IS NULL"

In [ ]:
#239
runSELECT('SELECT salesRepEmployeeNumber \
FROM customers \
WHERE salesRepEmployeeNumber IS NULL')

## UPDATE JOIN

In [ ]:
#240
!mysql -e "CREATE DATABASE IF NOT EXISTS empdb;"

In [ ]:
#241
!mysql -e "show databases"

In [ ]:
#242
!mysql -e "USE empdb"

In [ ]:
#243
!mysql empdb -e "CREATE TABLE merits (performance INT(11) NOT NULL, percentage FLOAT NOT NULL,PRIMARY KEY (performance));"

In [ ]:
#244
!mysql empdb -e "CREATE TABLE employees (emp_id INT(11) NOT NULL AUTO_INCREMENT,emp_name VARCHAR(255) NOT NULL,performance INT(11) DEFAULT NULL,salary FLOAT DEFAULT NULL,PRIMARY KEY (emp_id),CONSTRAINT fk_performance FOREIGN KEY (performance) REFERENCES merits (performance));"

In [ ]:
#245
!mysql empdb -e "INSERT INTO merits(performance,percentage) \
VALUES(1,0), \
      (2,0.01), \
      (3,0.03), \
      (4,0.05), \
      (5,0.08)"

In [ ]:
#246
!mysql empdb -e "INSERT INTO employees(emp_name,performance,salary) VALUES('Mary Doe', 1, 50000), ('Cindy Smith', 3, 65000), ('Sue Greenspan', 4, 75000), ('Grace Dell', 5, 125000), ('Nancy Johnson', 3, 85000), ('John Doe', 2, 45000), ('Lily Bush', 3, 55000)"

In [ ]:
#247
!mysql empdb -e "UPDATE employees INNER JOIN merits ON employees.performance = merits.performance SET  salary = salary + salary * percentage;"

In [ ]:
#248
#MySQL UPDATE JOIN example with LEFT JOIN
!mysql empdb -e "INSERT INTO employees(emp_name,performance,salary) VALUES('Jack William',NULL,43000), ('Ricky Bond',NULL,52000);"

In [ ]:
#249
!mysql empdb -e "UPDATE employees LEFT JOIN merits ON employees.performance = merits.performance  SET salary = salary + salary * 0.015 WHERE merits.percentage IS NULL;"

## DELETE

In [ ]:
#250
!mysql classicmodels -e "DELETE FROM employees  WHERE officeCode = 4"

In [ ]:
#251
!mysql classicmodels -e "DELETE FROM table_table LIMIT row_count;"

## ON DELETE CASCADE

In [ ]:
#252
!mysql classicmodels -e "CREATE TABLE buildings (building_no INT PRIMARY KEY AUTO_INCREMENT, building_name VARCHAR(255) NOT NULL, address VARCHAR(255) NOT NULL);"

In [ ]:
#253
!mysql classicmodels -e "CREATE TABLE rooms (room_no INT PRIMARY KEY AUTO_INCREMENT, room_name VARCHAR(255) NOT NULL, building_no INT NOT NULL, FOREIGN KEY (building_no) REFERENCES buildings (building_no) ON DELETE CASCADE);"

In [ ]:
#254
!mysql classicmodels -e "INSERT INTO buildings(building_name,address) VALUES('ACME Headquaters','3950 North 1st Street CA 95134'), ('ACME Sales','5000 North 1st Street CA 95134');"

In [ ]:
#255
runSELECT('SELECT * FROM buildings;')

In [ ]:
#256
!mysql classicmodels -e "INSERT INTO rooms(room_name,building_no)\
VALUES('Amazon',1),\
      ('War Room',1),\
      ('Office of CEO',1),\
      ('Marketing',2),\
      ('Showroom',2);"

In [ ]:
#257
runSELECT('SELECT * FROM rooms;')

In [ ]:
#258
!mysql classicmodels -e "DELETE FROM buildings  WHERE building_no = 2;"

In [ ]:
runSELECT('SELECT * FROM rooms;')

In [ ]:
#259
#find tables affected by MySQL ON DELETE CASCADE action
!mysql classicmodels -e "USE information_schema;"

In [ ]:
#260
runSELECT('SELECT table_name FROM referential_constraints WHERE constraint_schema = "classicmodels" AND referenced_table_name = "buildings" AND delete_rule = "CASCADE"')

## DELETE JOIN

In [ ]:
#261
#MySQL DELETE JOIN with INNER JOIN example
!mysql classicmodels -e "DROP TABLE IF EXISTS t1, t2;"

In [ ]:
#262
!mysql classicmodels -e "CREATE TABLE t1 ( id INT PRIMARY KEY AUTO_INCREMENT);"

In [ ]:
#263
!mysql classicmodels -e "CREATE TABLE t2 ( id VARCHAR(20) PRIMARY KEY, ref INT NOT NULL);"

In [ ]:
#264
!mysql classicmodels -e "INSERT INTO t1 VALUES (1),(2),(3);"

In [ ]:
#265
!mysql classicmodels -e "INSERT INTO t2(id,ref) VALUES('A',1),('B',2),('C',3);"

In [ ]:
#266
!mysql classicmodels -e "DELETE t1,t2 FROM t1 INNER JOIN t2 ON t2.ref = t1.id  WHERE t1.id = 1;"

In [ ]:
#267
!mysql classicmodels -e  "DELETE customers FROM customers LEFT JOIN orders ON customers.customerNumber = orders.customerNumber  WHERE orderNumber IS NULL"

In [ ]:
#268
runSELECT('SELECT c.customerNumber, c.customerName, orderNumber FROM customers c LEFT JOIN orders o ON c.customerNumber = o.customerNumber WHERE orderNumber IS NULL')

## REPLACE

In [ ]:
#269
!mysql classicmodels -e "CREATE TABLE cities (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(50), population INT NOT NULL);"

In [ ]:
#270
!mysql classicmodels -e "INSERT INTO cities(name,population) VALUES('New York',8008278), ('Los Angeles',3694825), ('San Diego',1223405);"

In [ ]:
#271
runSELECT('SELECT * FROM cities;')

In [ ]:
#272
!mysql classicmodels -e "REPLACE INTO cities(id,population) VALUES(2,3696820);"

In [ ]:
#273
runSELECT('SELECT * FROM cities;')

In [ ]:
#274
!mysql classicmodels -e "REPLACE INTO  cities(name,population) SELECT  name, population FROM cities WHERE id = 1"

## Prepared Statement

In [ ]:
#275
runSELECT("SELECT * FROM products WHERE productCode = '?'")

In [ ]:
#276
!mysql classicmodels -e "PREPARE stmt1 FROM 'SELECT productCode, productName FROM products WHERE productCode = ?';"

In [ ]:
#277
!mysql classicmodels -e "SET @pc = 'S10_1678'"

In [ ]:
#278
!mysql classicmodels -e "EXECUTE stmt1 USING @pc"

In [ ]:
#279
!mysql classicmodels -e "SET @pc = 'S12_1099'"

In [ ]:
#280
!mysql classicmodels -e "EXECUTE stmt1 USING @pc"

In [ ]:
#281
!mysql classicmodels -e "DEALLOCATE PREPARE stmt1"

#Chronobooks <br>
![alt text](https://1.bp.blogspot.com/-lTiYBkU2qbU/X1er__fvnkI/AAAAAAAAjtE/GhDR3OEGJr4NG43fZPodrQD5kbxtnKebgCLcBGAsYHQ/s600/Footer2020-600x200.png)<hr>
Chronotantra and Chronoyantra are two science fiction novels that explore the collapse of human civilisation on Earth and then its rebirth and reincarnation both on Earth as well as on the distant worlds of Mars, Titan and Enceladus. But is it the human civilisation that is being reborn? Or is it some other sentience that is revealing itself. 
If you have an interest in AI and found this material useful, you may consider buying these novel, in paperback or kindle, from [http://bit.ly/chronobooks](http://bit.ly/chronobooks)